DAEMod-915/DAEmod_EFR32/Testing/Software/Counter_FREERTOS/segmentlcd/src/sl_segmentlcd.c
#if defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}
#endif

/******************************************************************************
* @brief Display blocks on LCD display: blank, fill, outline, outline & fill
* @param topMode array of block modes for the top row with element zero
* representing the left-most column and element six representing the
* right-most column
* @param botMode array of block modes for the bottom row with element zero
* representing the left-most column and element six representing the
* right-most column
******************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_Block(
  SegmentLCD_BlockMode_TypeDef topMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS],
  SegmentLCD_BlockMode_TypeDef botMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS])
{
  /* If an update is in progress we must block, or there might be tearing */
  LCD_SyncBusyDelay(0xFFFFFFFF);

  /* Freeze LCD to avoid partial updates */
  LCD_FreezeEnable(true);

  /* Turn all segments off */
  SegmentLCD_AlphaNumberOff();

  displayBlock(topMode, botMode);

  /* Enable update */
  LCD_FreezeEnable(false);
}
#endif

/**************************************************************************//**
 * @brief Disables LCD controller
 *****************************************************************************/
void SegmentLCD_Disable(void)
{
  /* Disable LCD */
  LCD_Enable(false);

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /* Make sure CTRL register has been updated */
  LCD_SyncBusyDelay(LCD_SYNCBUSY_CTRL);
#else
  LCD_ReadyWait();
#endif

  /* Turn off LCD clock */
  CMU_ClockEnable(cmuClock_LCD, false);

#if defined(_SILICON_LABS_32B_SERIES_0)
  /* Turn off voltage boost if enabled */
  CMU->LCDCTRL = 0;
#endif
}

/**************************************************************************//**
 * @brief Segment LCD Initialization routine for EFM32 STK display
 * @param useBoost Set to use voltage boost
 *****************************************************************************/
void SegmentLCD_Init(bool useBoost)
{
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /* Ensure LE modules are accessible */
  CMU_ClockEnable(cmuClock_CORELE, true);

  /* Enable LFRCO as LFACLK in CMU (will also enable oscillator if not enabled) */
  CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFRCO);

  /* LCD Controller Prescaler  */
  CMU_ClockDivSet(cmuClock_LCDpre, LCD_CMU_CLK_PRE);

  /* Frame Rate */
  CMU_LCDClkFDIVSet(LCD_CMU_CLK_DIV);
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
  /* Enable LFRCO as LFACLK in CMU (will also enable oscillator if not enabled) */
  CMU_ClockSelectSet(cmuClock_LCD, cmuSelect_LFRCO);
#endif

  /* Enable clock to LCD module */
  CMU_ClockEnable(cmuClock_LCD, true);

  LCD_DISPLAY_ENABLE();

  /* Disable interrupts */
  LCD_IntDisable(0xFFFFFFFF);

  /* Initialize and enable LCD controller */
  LCD_Init(&lcdInit);
#if defined(_SILICON_LABS_32B_SERIES_1)
  if (lcdInit.chargeRedistribution == lcdChargeRedistributionDisable) {
    dynamicChgRedistEnabled = false;
  }
#endif

  /* Enable all display segments */
  LCD_SEGMENTS_ENABLE();

#if defined(_SILICON_LABS_32B_SERIES_2)
  CMU_ClockEnable(cmuClock_GPIO, true);
  for (uint8_t i = 0; i < LCD_COM_LINES_MAX; i++) {
    LCD_ComEnable(i, true);
  }
  for (uint8_t i = 0; i < LCD_SEGMENT_LINES_MAX; i++) {
    LCD_SegmentEnable(i, true);
  }
#endif

  /* Enable boost if necessary */
  if (useBoost) {
#if defined(_SILICON_LABS_32B_SERIES_0)
    LCD_VBoostSet(LCD_BOOST_LEVEL);
    LCD_VLCDSelect(lcdVLCDSelVExtBoost);
    CMU->LCDCTRL |= CMU_LCDCTRL_VBOOSTEN;
#elif defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
    /* Set charge pump mode and adjust contrast */
#if defined(_SILICON_LABS_32B_SERIES_1)
    LCD_ModeSet(lcdModeCpIntOsc);
#else
    LCD_ModeSet(lcdModeChargePump);
#endif
    LCD_ContrastSet(LCD_BOOST_CONTRAST);
#endif
  }

  /* Turn all segments off */
  SegmentLCD_AllOff();

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  LCD_SyncBusyDelay(0xFFFFFFFF);
#else
  LCD_ReadyWait();
#endif
}

/**************************************************************************//**
 * @brief Write a hexadecimal number on lower alphanumeric part of
 *        Segment LCD display
 * @param num Hexadecimal number value to put on display, in range 0
 *        to 0x0FFFFFFF
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_LowerHex(uint32_t num)
{
  int       i;
  char      str[ALPHA_DIGITS + 1];
  uint32_t  nibble;

#if defined(_SILICON_LABS_32B_SERIES_0)
  SegmentLCD_Symbol(LCD_SYMBOL_MINUS, 0);
#endif

  for (i = (ALPHA_DIGITS - 1); i >= 0; i--) {
    nibble = num & 0xF;

    if ( nibble < 10 ) {
      str[i] = nibble + '0';
    } else if ( nibble == 11 ) {
      str[i] = 'b';
    } else if ( nibble == 13 ) {
      str[i] = 'd';
    } else {
      str[i] = (nibble - 10) + 'A';
    }

    num >>= 4;
  }

  SegmentLCD_Write(str);
}
#endif

/**************************************************************************//**
 * @brief Write number on lower alphanumeric part of Segment LCD display
 * @param num Numeric value to put on display, in range -9999999 to +9999999
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_LowerNumber(int num)
{
  int i;
  char str[ALPHA_DIGITS + 1];
  bool neg = false;
  bool val = true;

  memset(str, 0, sizeof(str));
#if defined(_SILICON_LABS_32B_SERIES_0)
  SegmentLCD_Symbol(LCD_SYMBOL_MINUS, false);
#endif

  if ((num > ALPHA_VAL_MAX) || (num < ALPHA_VAL_MIN)) {
    SegmentLCD_Write("Ovrflow");
    return;
  }

  if (num < 0) {
    num = -num;
    neg = true;
  }

  for (i = (ALPHA_DIGITS - 1); i >= 0; i--) {
    if (val) {
      str[i] = (num % 10) + '0';
    } else {
      str[i] = neg ? '-' : ' ';
      neg = false;
    }
    num /= 10;
    val = (num != 0);
  }
#if defined(_SILICON_LABS_32B_SERIES_0)
  if (neg) {
    SegmentLCD_Symbol(LCD_SYMBOL_MINUS, true);
  }
#endif

  SegmentLCD_Write(str);
}
#endif

/**************************************************************************//**
 * @brief Write number on numeric part on Segment LCD display
 * @param value Numeric value to put on display, in range -999 to +9999
 *****************************************************************************/
void SegmentLCD_Number(int value)
{
  int      i, com, bit, digit, div, neg;
  uint16_t bitpattern;
  uint16_t num;

