DAEMod-915/DAEmod_EFR32/Testing/Software/Counter_FREERTOS/segmentlcd/src/sl_segmentlcd.c
  /* Parameter consistancy check */
  if (value >= NUM_VAL_MAX) {
    value = NUM_VAL_MAX;
  }
  if (value < NUM_VAL_MIN) {
    value = NUM_VAL_MIN;
  }
  if (value < 0) {
    value = abs(value);
    neg   = 1;
  } else {
    neg = 0;
  }

  /* If an update is in progress we must block, or there might be tearing */
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  LCD_SyncBusyDelay(0xFFFFFFFF);
  /* Freeze updates to avoid partial refresh of display */
  LCD_FreezeEnable(true);
#else
  LCD_LoadBusyWait();
#endif


  /* Turn off all number LCD segments */
  SegmentLCD_NumberOff();

  /* Extract useful digits */
  div = 1;
  for (digit = 0; digit < NUM_DIGITS; digit++) {
    num = (value / div) % 10;
    if ((neg == 1) && (digit == (NUM_DIGITS - 1))) {
      num = signIndex;
    }
    /* Get number layout of display */
    bitpattern = Segment_Numbers[num];
    for (i = 0; i < 7; i++) {
      bit = EFM_Display.Number[digit].bit[i];
      com = EFM_Display.Number[digit].com[i];
      if (bitpattern & (1 << i)) {
        LCD_SegmentSet(com, bit, true);
      }
    }
    div = div * 10;
  }
  /* Sync LCD registers to LE domain */
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  LCD_FreezeEnable(false);
#else
  LCD_SyncStart(false, lcdLoadAddrNone);
  LCD_LoadBusyWait();
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}

/**************************************************************************//**
 * @brief Turn all segments on numeric digits in display off
 *****************************************************************************/
void SegmentLCD_NumberOff(void)
{
  /* Turn off all number segments */
  LCD_NUMBER_OFF();

#if defined(_SILICON_LABS_32B_SERIES_2)
  LCD_SyncStart(false, lcdLoadAddrNone);
  LCD_LoadBusyWait();
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}

/**************************************************************************//**
 * @brief Light up or shut off various symbols on Segment LCD
 * @param s Which symbol to turn on or off
 * @param on Zero is off, non-zero is on
 *****************************************************************************/
void SegmentLCD_Symbol(lcdSymbol s, int on)
{
  int com = 0;
  int bit = 0;

  switch (s) {
#ifdef LCD_SYMBOL_GECKO_SEG
    case LCD_SYMBOL_GECKO:
      com = LCD_SYMBOL_GECKO_COM;
      bit = LCD_SYMBOL_GECKO_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_ANT_SEG
    case LCD_SYMBOL_ANT:
      com = LCD_SYMBOL_ANT_COM;
      bit = LCD_SYMBOL_ANT_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_PAD0_SEG
    case LCD_SYMBOL_PAD0:
      com = LCD_SYMBOL_PAD0_COM;
      bit = LCD_SYMBOL_PAD0_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_PAD1_SEG
    case LCD_SYMBOL_PAD1:
      com = LCD_SYMBOL_PAD1_COM;
      bit = LCD_SYMBOL_PAD1_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_EFM32_SEG
    case LCD_SYMBOL_EFM32:
      com = LCD_SYMBOL_EFM32_COM;
      bit = LCD_SYMBOL_EFM32_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_MINUS_SEG
    case LCD_SYMBOL_MINUS:
      com = LCD_SYMBOL_MINUS_COM;
      bit = LCD_SYMBOL_MINUS_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C1_SEG
    case LCD_SYMBOL_C1:
      com = LCD_SYMBOL_C1_COM;
      bit = LCD_SYMBOL_C1_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C2_SEG
    case LCD_SYMBOL_C2:
      com = LCD_SYMBOL_C2_COM;
      bit = LCD_SYMBOL_C2_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C3_SEG
    case LCD_SYMBOL_C3:
      com = LCD_SYMBOL_C3_COM;
      bit = LCD_SYMBOL_C3_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C4_SEG
    case LCD_SYMBOL_C4:
      com = LCD_SYMBOL_C4_COM;
      bit = LCD_SYMBOL_C4_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C5_SEG
    case LCD_SYMBOL_C5:
      com = LCD_SYMBOL_C5_COM;
      bit = LCD_SYMBOL_C5_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C6_SEG
    case LCD_SYMBOL_C6:
      com = LCD_SYMBOL_C6_COM;
      bit = LCD_SYMBOL_C6_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C7_SEG
    case LCD_SYMBOL_C7:
      com = LCD_SYMBOL_C7_COM;
      bit = LCD_SYMBOL_C7_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C8_SEG
    case LCD_SYMBOL_C8:
      com = LCD_SYMBOL_C8_COM;
      bit = LCD_SYMBOL_C8_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C9_SEG
    case LCD_SYMBOL_C9:
      com = LCD_SYMBOL_C9_COM;
      bit = LCD_SYMBOL_C9_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C10_SEG
    case LCD_SYMBOL_C10:
      com = LCD_SYMBOL_C10_COM;
      bit = LCD_SYMBOL_C10_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C11_SEG
    case LCD_SYMBOL_C11:
      com = LCD_SYMBOL_C11_COM;
      bit = LCD_SYMBOL_C11_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C12_SEG
    case LCD_SYMBOL_C12:
      com = LCD_SYMBOL_C12_COM;
      bit = LCD_SYMBOL_C12_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C13_SEG
    case LCD_SYMBOL_C13:
      com = LCD_SYMBOL_C13_COM;
      bit = LCD_SYMBOL_C13_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C14_SEG
    case LCD_SYMBOL_C14:
      com = LCD_SYMBOL_C14_COM;
      bit = LCD_SYMBOL_C14_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C15_SEG
    case LCD_SYMBOL_C15:
      com = LCD_SYMBOL_C15_COM;
      bit = LCD_SYMBOL_C15_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C16_SEG
    case LCD_SYMBOL_C16:
      com = LCD_SYMBOL_C16_COM;
      bit = LCD_SYMBOL_C16_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C17_SEG
    case LCD_SYMBOL_C17:
      com = LCD_SYMBOL_C17_COM;
      bit = LCD_SYMBOL_C17_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C18_SEG
    case LCD_SYMBOL_C18:
      com = LCD_SYMBOL_C18_COM;
      bit = LCD_SYMBOL_C18_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_C19_SEG
    case LCD_SYMBOL_C19:
      com = LCD_SYMBOL_C19_COM;
      bit = LCD_SYMBOL_C19_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_COL1_SEG
    case LCD_SYMBOL_COL1:
      com = LCD_SYMBOL_COL1_COM;
      bit = LCD_SYMBOL_COL1_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_COL2_SEG
    case LCD_SYMBOL_COL2:
      com = LCD_SYMBOL_COL2_COM;
      bit = LCD_SYMBOL_COL2_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_COL3_SEG
    case LCD_SYMBOL_COL3:
      com = LCD_SYMBOL_COL3_COM;
      bit = LCD_SYMBOL_COL3_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_COL5_SEG
    case LCD_SYMBOL_COL5:
      com = LCD_SYMBOL_COL5_COM;
      bit = LCD_SYMBOL_COL5_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_COL10_SEG
    case LCD_SYMBOL_COL10:
      com = LCD_SYMBOL_COL10_COM;
      bit = LCD_SYMBOL_COL10_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DEGC_SEG
    case LCD_SYMBOL_DEGC:
      com = LCD_SYMBOL_DEGC_COM;
      bit = LCD_SYMBOL_DEGC_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DEGF_SEG
    case LCD_SYMBOL_DEGF:
      com = LCD_SYMBOL_DEGF_COM;
      bit = LCD_SYMBOL_DEGF_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP2_SEG
    case LCD_SYMBOL_DP2:
      com = LCD_SYMBOL_DP2_COM;
      bit = LCD_SYMBOL_DP2_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP3_SEG
    case LCD_SYMBOL_DP3:
      com = LCD_SYMBOL_DP3_COM;
      bit = LCD_SYMBOL_DP3_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP4_SEG
    case LCD_SYMBOL_DP4:
      com = LCD_SYMBOL_DP4_COM;
      bit = LCD_SYMBOL_DP4_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP5_SEG
    case LCD_SYMBOL_DP5:
      com = LCD_SYMBOL_DP5_COM;
      bit = LCD_SYMBOL_DP5_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP6
    case LCD_SYMBOL_DP6:
      com = LCD_SYMBOL_DP6_COM;
      bit = LCD_SYMBOL_DP6_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_DP10
    case LCD_SYMBOL_DP10:
      com = LCD_SYMBOL_DP10_COM;
      bit = LCD_SYMBOL_DP10_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_AM_SEG
    case LCD_SYMBOL_AM:
      com = LCD_SYMBOL_AM_COM;
      bit = LCD_SYMBOL_AM_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_PM_SEG
    case LCD_SYMBOL_PM:
      com = LCD_SYMBOL_PM_COM;
      bit = LCD_SYMBOL_PM_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_MICROAMP_SEG
    case LCD_SYMBOL_MICROAMP:
      com = LCD_SYMBOL_MICROAMP_COM;
      bit = LCD_SYMBOL_MICROAMP_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_MILLIAMP_SEG
    case LCD_SYMBOL_MILLIAMP:
      com = LCD_SYMBOL_MILLIAMP_COM;
      bit = LCD_SYMBOL_MILLIAMP_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S2_SEG
    case LCD_SYMBOL_S2:
      com = LCD_SYMBOL_S2_COM;
      bit = LCD_SYMBOL_S2_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S3_SEG
    case LCD_SYMBOL_S3:
      com = LCD_SYMBOL_S3_COM;
      bit = LCD_SYMBOL_S3_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S4_SEG
    case LCD_SYMBOL_S4:
      com = LCD_SYMBOL_S4_COM;
      bit = LCD_SYMBOL_S4_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S5_SEG
    case LCD_SYMBOL_S5:
      com = LCD_SYMBOL_S5_COM;
      bit = LCD_SYMBOL_S5_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S6_SEG
    case LCD_SYMBOL_S6:
      com = LCD_SYMBOL_S6_COM;
      bit = LCD_SYMBOL_S6_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S7_SEG
    case LCD_SYMBOL_S7:
      com = LCD_SYMBOL_S7_COM;
      bit = LCD_SYMBOL_S7_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S8_SEG
    case LCD_SYMBOL_S8:
      com = LCD_SYMBOL_S8_COM;
      bit = LCD_SYMBOL_S8_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S9_SEG
    case LCD_SYMBOL_S9:
      com = LCD_SYMBOL_S9_COM;
      bit = LCD_SYMBOL_S9_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S10_SEG
    case LCD_SYMBOL_S10:
      com = LCD_SYMBOL_S10_COM;
      bit = LCD_SYMBOL_S10_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S11_SEG
    case LCD_SYMBOL_S11:
      com = LCD_SYMBOL_S11_COM;
      bit = LCD_SYMBOL_S11_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S12_SEG
    case LCD_SYMBOL_S12:
      com = LCD_SYMBOL_S12_COM;
      bit = LCD_SYMBOL_S12_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S13_SEG
    case LCD_SYMBOL_S13:
      com = LCD_SYMBOL_S13_COM;
      bit = LCD_SYMBOL_S13_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_S14_SEG
    case LCD_SYMBOL_S14:
      com = LCD_SYMBOL_S14_COM;
      bit = LCD_SYMBOL_S14_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_P2_SEG
    case LCD_SYMBOL_P2:
      com = LCD_SYMBOL_P2_COM;
      bit = LCD_SYMBOL_P2_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_P3_SEG
    case LCD_SYMBOL_P3:
      com = LCD_SYMBOL_P3_COM;
      bit = LCD_SYMBOL_P3_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_P4_SEG
    case LCD_SYMBOL_P4:
      com = LCD_SYMBOL_P4_COM;
      bit = LCD_SYMBOL_P4_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_P5_SEG
    case LCD_SYMBOL_P5:
      com = LCD_SYMBOL_P5_COM;
      bit = LCD_SYMBOL_P5_SEG;
      break;
#endif
#ifdef LCD_SYMBOL_P6_SEG
    case LCD_SYMBOL_P6:
      com = LCD_SYMBOL_P6_COM;
      bit = LCD_SYMBOL_P6_SEG;
      break;
#endif
    default:
      break;
  }
  if (on) {
    LCD_SegmentSet(com, bit, true);
  } else {
    LCD_SegmentSet(com, bit, false);
  }

