DAEMod-915/DAEmod_EFR32/Testing/Software/Counter_FREERTOS/segmentlcd/src/sl_segmentlcd.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  LCD_SyncStart(false, lcdLoadAddrNone);
  LCD_LoadBusyWait();
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}

/**************************************************************************//**
 * @brief Write hexadecimal number on numeric part on Segment LCD display
 * @param value Numeric value to put on display
 *****************************************************************************/
void SegmentLCD_UnsignedHex(uint32_t value)
{
  int      num, i, com, bit, digit;
  uint16_t bitpattern;

  /* Parameter consistancy check */
  if (value >= NUM_VAL_MAX_HEX) {
    value = NUM_VAL_MAX_HEX;
  }

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /* If an update is in progress we must block, or there might be tearing */
  LCD_SyncBusyDelay(0xFFFFFFFF);

  /* Freeze updates to avoid partial refresh of display */
  LCD_FreezeEnable(true);
#else
  LCD_LoadBusyWait();
#endif

  /* Turn off all number LCD segments */
  SegmentLCD_NumberOff();

  for (digit = 0; digit < NUM_DIGITS; digit++) {
    num        = (value >> (4 * digit)) & 0x0f;
    bitpattern = Segment_Numbers[num];
    for (i = 0; i < 7; i++) {
      bit = EFM_Display.Number[digit].bit[i];
      com = EFM_Display.Number[digit].com[i];
      if (bitpattern & (1 << i)) {
        LCD_SegmentSet(com, bit, true);
      }
    }
  }

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /* Sync LCD registers to LE domain */
  LCD_FreezeEnable(false);
#else
  LCD_SyncStart(false, lcdLoadAddrNone);
  LCD_LoadBusyWait();
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}

/**************************************************************************//**
 * @brief Write text on LCD display
 * @param string Text string to show on display
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_Write(const char *string)
{
  int      data, length, index;
  uint16_t bitfield;
  uint32_t com, bit;
  int      i;

  length = strlen(string);
  index  = 0;

  /* If an update is in progress we must block, or there might be tearing */
  LCD_SyncBusyDelay(0xFFFFFFFF);

  /* Freeze LCD to avoid partial updates */
  LCD_FreezeEnable(true);

  /* Turn all segments off */
  SegmentLCD_AlphaNumberOff();

  /* Fill out all characters on display */
  for (index = 0; index < ALPHA_DIGITS; index++) {
    if (index < length) {
      data = (int) *string;
    } else {       /* Padding with space */
      data = 0x20; /* SPACE */
    }
    /* Defined letters currently starts at "SPACE" - ASCII 0x20; */
    data = data - 0x20;
    /* Get font for this letter */
    bitfield = Segment_Alphabet[data];

    for (i = 0; i < 14; i++) {
      bit = EFM_Display.Text[index].bit[i];
      com = EFM_Display.Text[index].com[i];

      if (bitfield & (1 << i)) {
        /* Turn on segment */
        LCD_SegmentSet(com, bit, true);
      }
    }
    string++;
  }
  /* Enable update */
  LCD_FreezeEnable(false);

#if defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
  /* Evaluating the updated display contents and switching charge
     redistribution ON or OFF accordingly (only if dynamic change is enabled) */
  if (dynamicChgRedistEnabled) {
    SegmentLCD_updateCHGRDST();
  }
#endif
}
#endif

/**************************************************************************//**
 * @brief Counting the number of active segments in a single common line
 * @param value in registers LCD_SEGDnL and LCD_SEGDnH  (n = common line number)
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_1)
unsigned int SegmentLCD_segCnt(unsigned int segdl, unsigned int segdh)
{
  /* Number of ones in a nibble */
  const unsigned int oneCnt[16] = { 0, 1, 1, 2, 1, 2, 2, 3, 1, 2, 2, 3, 2, 3, 3, 4 };

  unsigned int cnt = 0;

  /* Accumulating number of ones in each nibble */
  cnt += oneCnt[(segdl >>  0) & 0x0000000f];
  cnt += oneCnt[(segdl >>  4) & 0x0000000f];
  cnt += oneCnt[(segdl >>  8) & 0x0000000f];
  cnt += oneCnt[(segdl >> 12) & 0x0000000f];
  cnt += oneCnt[(segdl >> 16) & 0x0000000f];
  cnt += oneCnt[(segdl >> 20) & 0x0000000f];
  cnt += oneCnt[(segdl >> 24) & 0x0000000f];
  cnt += oneCnt[(segdl >> 28) & 0x0000000f];
  cnt += oneCnt[(segdh >>  0) & 0x0000000f];
  cnt += oneCnt[(segdh >>  4) & 0x0000000f];

  return cnt;
}
#endif

/**************************************************************************//**
 * @brief Enabling/disabling dynamic charge redistribution
 * @param true ==> enable, false ==> disable
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_chargeRedistributionEnable(bool enable)
{
  if ( enable ) {
    LCD->DISPCTRL = (LCD->DISPCTRL & ~_LCD_DISPCTRL_CHGRDST_MASK)
                    | lcdChargeRedistributionEnable;
    dynamicChgRedistEnabled = true;
  } else {
    LCD->DISPCTRL = (LCD->DISPCTRL & ~_LCD_DISPCTRL_CHGRDST_MASK)
                    | lcdChargeRedistributionDisable;
    dynamicChgRedistEnabled = false;
  }
}
#endif

/**************************************************************************//**
 * @brief
 * Dynamically switching charge redistribution ON/OFF based on display contents
 * @param None
 *****************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_1)
void SegmentLCD_updateCHGRDST(void)
{
  const unsigned int COM_0_THRESHOLD_HI = 20;
  const unsigned int COM_0_THRESHOLD_LO = 14;
  const unsigned int COM_1_6_THRESHOLD_HI = 11;
  const unsigned int COM_1_6_THRESHOLD_LO = 9;
#if defined(_SILICON_LABS_32B_SERIES_1)
  const unsigned int COM_7_THRESHOLD_HI = 28;
  const unsigned int COM_7_THRESHOLD_LO = 24;
#endif
  const unsigned int SEG_TOTAL_THRESHOLD = 40;
  unsigned int segdl, segCnt;
  unsigned int segCntAcc = 0;
  bool thresholdHiReached = false;
  bool thresholdLoReached = false;
  bool switchChgRedistON = false;

#if defined(_SILICON_LABS_32B_SERIES_1)
  segdl = LCD->SEGD0L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD0H);
#else
  segdl = LCD->SEGD0;
  segCnt = SegmentLCD_segCnt(segdl, 0);
#endif
  if (segCnt >= COM_0_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_0_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

#if defined(_SILICON_LABS_32B_SERIES_1)
  segdl = LCD->SEGD1L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD1H);
#else
  segdl = LCD->SEGD1;
  segCnt = SegmentLCD_segCnt(segdl, 0);
#endif
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

#if defined(_SILICON_LABS_32B_SERIES_1)
  segdl = LCD->SEGD2L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD2H);
#else
  segdl = LCD->SEGD2;
  segCnt = SegmentLCD_segCnt(segdl, 0);
#endif
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

#if defined(_SILICON_LABS_32B_SERIES_1)
  segdl = LCD->SEGD3L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD3H);
#else
  segdl = LCD->SEGD3;
  segCnt = SegmentLCD_segCnt(segdl, 0);
#endif
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

#if defined(_SILICON_LABS_32B_SERIES_1)
  segdl = LCD->SEGD4L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD4H);
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

  segdl = LCD->SEGD5L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD5H);
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

