DAEMod-915/DAEmod_EFR32/Testing/Software/Counter_FREERTOS/segmentlcd/src/sl_segmentlcd.c
  segdl = LCD->SEGD6L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD6H);
  if (segCnt >= COM_1_6_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_1_6_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
  segCntAcc += segCnt;

  segdl = LCD->SEGD7L;
  segCnt = SegmentLCD_segCnt(segdl, LCD->SEGD7H);
  if (segCnt >= COM_7_THRESHOLD_HI) {
    thresholdHiReached = true;
  }
  if (segCnt >= COM_7_THRESHOLD_LO) {
    thresholdLoReached = true;
  }
#endif
  segCntAcc += segCnt;

  /* Switch charge redistribution ON if condition 1 or 2 (or both) below is met
     1. at least one of the common lines has reached its high threshold
        of active segments
     2. at least one of the common lines has reached its low threshold
        of active segments and there are 40 or more active segments in
        the display (i.e. all common lines combined) */
  switchChgRedistON =
    (thresholdHiReached)
    || (thresholdLoReached && (segCntAcc >= SEG_TOTAL_THRESHOLD));

  if (switchChgRedistON) {
    /* Switching charge redistribution ON */
    LCD->DISPCTRL = (LCD->DISPCTRL & ~_LCD_DISPCTRL_CHGRDST_MASK)
                    | lcdChargeRedistributionEnable;
  } else {
    /* Switching charge redistribution OFF */
    LCD->DISPCTRL = (LCD->DISPCTRL & ~_LCD_DISPCTRL_CHGRDST_MASK)
                    | lcdChargeRedistributionDisable;
  }
}
#endif

/******************************************************************************
* @brief Display blocks on LCD display: blank, fill, outline, outline & fill
* @param topMode array of block modes for the top row with element zero
* representing the left-most column and element six representing the
* right-most column
* @param botMode array of block modes for the bottom row with element zero
* representing the left-most column and element six representing the
* right-most column
******************************************************************************/
#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
static void displayBlock(
  SegmentLCD_BlockMode_TypeDef topMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS],
  SegmentLCD_BlockMode_TypeDef botMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS])
{
  int index;
  int mode;
  uint16_t bitfield;
  uint32_t com, bit;
  int      i;

  /* Fill out all blocks in the top row of the display */
  for (index = 0; index < SEGMENT_LCD_NUM_BLOCK_COLUMNS; index++) {
    mode = topMode[index];

    /* Get segment bitmap for this block position */
    bitfield = Blocks[mode];

    for (i = 0; i < 8; i++) {
      if (bitfield & (1 << i)) {
        bit = EFM_Display.TopBlocks[index].bit[i];
        com = EFM_Display.TopBlocks[index].com[i];

        // Turn on segment
        LCD_SegmentSet(com, bit, true);
      }
    }
  }
  /* Fill out all blocks in the bottom row of the display */
  for (index = 0; index < SEGMENT_LCD_NUM_BLOCK_COLUMNS; index++) {
    mode = botMode[index];

    /* Get segment bitmap for this block position */
    bitfield = Blocks[mode];

    for (i = 0; i < 8; i++) {
      if (bitfield & (1 << i)) {
        bit = EFM_Display.BotBlocks[index].bit[i];
        com = EFM_Display.BotBlocks[index].com[i];

        // Turn on segment
        LCD_SegmentSet(com, bit, true);
      }
    }
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
#if defined(LCD_MODULE_CE322_1001)
/**************************************************************************//**
 * @brief Turn on or off individual pixels in the array
 * @param element "pixel number", range 0 - 34
 * @param on false is off, true is on
 *****************************************************************************/
void SegmentLCD_Array(int element, bool on)
{
  uint32_t com, bit;

  com = EFM_Display.Array.com[element];
  bit = EFM_Display.Array.bit[element];
  LCD_SegmentSet(com, bit, on);
}

#else

/**************************************************************************//**
 * @brief Light up or shut off Ring of Indicators
 * @param anum "Segment number" on "Ring", range 0 - 7
 * @param on Zero is off, non-zero is on
 *****************************************************************************/
void SegmentLCD_ARing(int anum, int on)
{
  uint32_t com, bit;

  com = EFM_Display.ARing.com[anum];
  bit = EFM_Display.ARing.bit[anum];

  if (on) {
    LCD_SegmentSet(com, bit, true);
  } else {
    LCD_SegmentSet(com, bit, false);
  }
}

/**************************************************************************//**
 * @brief Light up or shut off Battery Indicator
 * @param batteryLevel Battery Level, 0 to 4 (0 turns all off)
 *****************************************************************************/
void SegmentLCD_Battery(int batteryLevel)
{
  uint32_t com, bit;
  int      i, on;

  for (i = 0; i < 4; i++) {
    if (i < batteryLevel) {
      on = 1;
    } else {
      on = 0;
    }
    com = EFM_Display.Battery.com[i];
    bit = EFM_Display.Battery.bit[i];

    if (on) {
      LCD_SegmentSet(com, bit, true);
    } else {
      LCD_SegmentSet(com, bit, false);
    }
  }
}

/**************************************************************************//**
 * @brief Light up or shut off Energy Mode indicator
 * @param em Energy Mode numer 0 to 4
 * @param on Zero is off, non-zero is on
 *****************************************************************************/
void SegmentLCD_EnergyMode(int em, int on)
{
  uint32_t com, bit;

  com = EFM_Display.EMode.com[em];
  bit = EFM_Display.EMode.bit[em];

  if (on) {
    LCD_SegmentSet(com, bit, true);
  } else {
    LCD_SegmentSet(com, bit, false);
  }
}
#endif
#endif

/** @} (end group SegmentLcd) */
